Autodesk.Revit.DB.KeynoteTable.GetKeynoteTable(Autodesk.Revit.DB.Document)
Gets the KeynoteTable from a Revit document.
aDoc:
The Revit document.
Returns:
The KeynoteTable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.KeynoteTable
KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.
Since:
2015